Autodesk.Revit.DB.Structure.RebarHookType.CreateDefaultRebarHookType(Autodesk.Revit.DB.Document)
Creates a new RebarHookType object with a default name.
ADoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.RebarHookType.GetHookExtensionLength(Autodesk.Revit.DB.Structure.RebarBarType)
Computes the hook extension length based on current hook length
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.RebarHookType.GetDefaultHookExtension(System.Double)
Computes the default hook length, which is equal to barDiameter * multiplier.

Autodesk.Revit.DB.Structure.RebarHookType.IsOffsetLengthRequired
Check whether hook offset length is required.
remarks: If hook angle is no more than 90 degree, hook offset length is not meaningful.
returns: True if hook offset length is required, otherwise false.

Autodesk.Revit.DB.Structure.RebarHookType.Create(Autodesk.Revit.DB.Document,System.Double,System.Double)
Creates a new RebarHookType in a document.
angle:
Determine the hook angle of new RebarHookType.
multiplier:
Determine the straight line multiplier of new RebarHookType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not a number
-or-
The given value for multiplier is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
angle must be greater than 0 and no more than pi.
-or-
multiplier must be greater than 0 and no more than 99.

Autodesk.Revit.DB.Structure.RebarHookType.StraightLineMultiplier
Multiplier of bar diameter. Used to compute a default hook length.
The default hook length can be overridden by the RebarBarType class.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for straightLineMultiplier is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: straightLineMultiplier must be greater than 0 and no more than 99.

Autodesk.Revit.DB.Structure.RebarHookType.HookAngle
The hook angle, measured in radians. Must be greater than 0 and no more than pi.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for hookAngle is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: hookAngle must be greater than 0 and no more than pi.

Autodesk.Revit.DB.Structure.RebarHookType.Style
The hook may only be applied to shapes of the specified style.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Structure.RebarHookType
A Rebar Hook type object that is used in the generation of Rebar.
Remarks:
This object contains the definition of the hooks that may be created at the ends
of the rebar. The specifics of these hooks are angle (range 0-PI) between first/last
segment of rebar and the straight segment of the hook, rebar shape style and
a multiplier used to compute the length of the straight segment of the hook.
The default length is computed as the bar diameter * the multiplier.
Length can be overridden by settings in the RebarBarType class.